<?php

$MESS['GREENSIGHT_ST1234_PDF_TITLE'] = 'Формирование PDF-файла';
$MESS['GREENSIGHT_TABPDF']           = 'Введите данные';
$MESS['GREENSIGHT_TABPDF_TITLE']     = 'Введите данные';
$MESS['GREENSIGHT_FOR_CHEEF']        = 'Начальнику';
$MESS['GREENSIGHT_UNIT']             = '&lt; укажите наименование структурного подразделения ГИБДД и фамилию начальника &gt;';
$MESS['GREENSIGHT_FROM']             = 'От';
$MESS['GREENSIGHT_YOUR_NAME']        = '&lt; фамилия, имя и отчество заявителя &gt;';
$MESS['YOUR_MAIL']                   = 'Почтовый адрес заявителя (для переписки и получения уведомлений)';
$MESS['PROMISE']                     = 'Мы не храним на сайте почтовые адреса заявителей';
$MESS['MESSAGE']                     = 'мною на дорожном покрытии/на проезжей части/и т.д.';
$MESS['STREET_TITLE']                = '&lt; укажите название улицы (можно в родительном падеже) &gt;';
$MESS['DEFECT']                      = 'был обнаружен дефект ... и далее по тексту.';
$MESS['STREET_ADDRES']               = 'улицы';
$MESS['YOUR_MIND']                   = 'Если дефект дороги представляет собой работающий в плохом режиме светофор, то можно казать причину изменения режима и предложить свой вариант';
$MESS['SIGNATURE']                   = 'Подпись (фамилия и инициалы в именительном падеже)';
?>