<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetPageProperty("title", "Пожертвования и затраты");
$APPLICATION->SetPageProperty("NOT_SHOW_NAV_CHAIN", "Y");
$APPLICATION->SetTitle("Пожертвования и затраты");
?>

<h1><?= $APPLICATION->ShowTitle(); ?></h1>
</div></div>
<br clear="all">
<div class="mainCols">

<p><b>Деньги в поддержку РосЯмы можно перечислять сюда:</b></p>

<p><b>Яндекс.Деньги</b> кошелёк № 41001550415485</p>

<p><b>PayPal</b> fezeev@gmail.com</p>

<p><h4>Банковский перевод:</h4>
Банк получателя ОАО «Альфа- Банк», г. Москва<br>
БИК 044525593<br>
К/с 30101810200000000593<br>
Наименование получателя: Езеев Федор Андреевич<br>
№ счета получателя: 40817810606050014327<br>
Назначение платежа: Дарение.
</p>

<!--

<h3>На __.__.____ собрано ____ рублей</h3>

<h3>Таблица расходов</h3>
<table>
<b><tr><td>Дата</td><td>Сумма</td><td>Назначение</td></tr></b>
<tr><td>...</td> <td>...</td> <td>...</td></tr> -->
<!-- <tr><td>Дата</td> <td>Сумма</td> <td>Назначение</td></tr> -->
<!-- <tr><td>Дата</td> <td>Сумма</td> <td>Назначение</td></tr> -->

<!--
</table>
-->

	
	<!--

	<h2>ГОСТ Р 50597-93 &laquo;Автомобильные дороги и улицы. Требования к эксплуатационному состоянию, допустимому по условиям обеспечения безопасности дорожного движения&raquo;</h2>
	<p><a href="GOST-R-50597-93.pdf" target="_blank"><img src="/images/pdf_doc.gif"></a> <a href="GOST-R-50597-93.pdf" target="_blank">Прочитать или скачать ГОСТ Р 50597-93 &laquo;Автомобильные дороги и улицы ...&raquo; в формате PDF</a></p>
	<p>Настоящий стандарт устанавливает перечень и допустимые по условиям обеспечения безопасности движения предельные значения показателей эксплуатационного состояния автомобильных дорог, улиц и дорог городов и других населенных пунктов, а также требования к эксплуатационному состоянию технических средств организации дорожного движения. Все требования стандарта являются обязательными и направлены на обеспечение безопасности дорожного движения, сохранение жизни, здоровья и имущества населения, охрану окружающей среды.</p>
	<p>Повреждениями дорожного покрытия являются:<br>
		<ul class="default">
			<li>Ямы, выбоины, просадки дорожного полотна, превышающие хотя бы один из следующих параметров: ширина &mdash; 60&nbsp;см., длина &mdash; 15&nbsp;см., глубина &mdash; 5&nbsp;см.</li>
			<li>Отклонение крышки люка смотрового колодца относительно уровня покрытия более 2,0&nbsp;см.</li>
			<li>Отклонение верха головки рельса трамвайных или железнодорожных путей, расположенных в пределах проезжей части, относительно покрытия более 2,0&nbsp;см.</li>
		</ul>
	</p>
	<p>ГОСТ Р 50597-93 действует на всех классах дорог: от федеральных автомагистралей до дворовых проездов.</p>
	<p>ГОСТ Р 50597-93 действует только на проезжую часть дороги.</p>
	<p>В с тротуарами в настоящее время уточняется.</p>
	-->
</div>

<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");
?>