<?php

/**
 * Справочник субъектов РФ.
 */

class CGreensightRFSubject
{
	// справочник кратких наименований для поиска
	public static $_RF_SUBJECTS = array
	(
		1 => 'Адыгея',
		2 => 'Алтай',
		3 => 'Башкортостан',
		4 => 'Бурятия',
		5 => 'Дагестан',
		6 => 'Ингушетия',
		7 => 'Кабардино-Балкарская',
		8 => 'Калмыкия',
		9 => 'Карачаево-Черкесская',
		10 => 'Карелия',
		11 => 'Коми',
		12 => 'Марий Эл',
		13 => 'Мордовия',
		14 => 'Саха',
		15 => 'Осетия-Алания',
		16 => 'Татарстан',
		17 => 'Тыва',
		18 => 'Удмуртская',
		19 => 'Хакасия',
		20 => 'Чеченская',
		21 => 'Чувашская',
		22 => 'Алтайский',
		23 => 'Забайкальский',
		24 => 'Камчатский',
		25 => 'Краснодарский',
		26 => 'Красноярский',
		27 => 'Пермский',
		28 => 'Приморский',
		29 => 'Ставропольский',
		30 => 'Хабаровский',
		31 => 'Амурская',
		32 => 'Архангельская',
		33 => 'Астраханская',
		34 => 'Белгородская',
		35 => 'Брянская',
		36 => 'Владимирская',
		37 => 'Волгоградская',
		38 => 'Вологодская',
		39 => 'Воронежская',
		40 => 'Ивановская',
		41 => 'Иркутская',
		42 => 'Калининградская',
		43 => 'Калужская',
		44 => 'Кемеровская',
		45 => 'Кировская',
		46 => 'Костромская',
		47 => 'Курганская',
		48 => 'Курская',
		49 => 'Ленинградская',
		50 => 'Липецкая',
		51 => 'Магаданская',
		52 => 'Московская',
		53 => 'Мурманская',
		54 => 'Нижегородская',
		55 => 'Новгородская',
		56 => 'Новосибирская',
		57 => 'Омская',
		58 => 'Оренбургская',
		59 => 'Орловская',
		60 => 'Пензенская',
		61 => 'Псковская',
		62 => 'Ростовская',
		63 => 'Рязанская',
		64 => 'Самарская',
		65 => 'Саратовская',
		66 => 'Сахалинская',
		67 => 'Свердловская',
		68 => 'Смоленская',
		69 => 'Тамбовская',
		70 => 'Тверская',
		71 => 'Томская',
		72 => 'Тульская',
		73 => 'Тюменская',
		74 => 'Ульяновская',
		75 => 'Челябинская',
		76 => 'Ярославская',
		77 => 'Москва',
		78 => 'Санкт-Петербург',
		79 => 'Еврейская',
		80 => 'Ненецкий',
		81 => 'Ханты-Мансийский',
		82 => 'Чукотский',
		83 => 'Ямало-Ненецкий'
	);
	
	// полные наименования
	public static $_RF_SUBJECTS_FULL = array
	(
		1 => 'Республика Адыгея',
		2 => 'Республика Алтай',
		3 => 'Республика Башкортостан',
		4 => 'Республика Бурятия',
		5 => 'Республика Дагестан',
		6 => 'Республика Ингушетия',
		7 => 'Кабардино-Балкарская республика',
		8 => 'Республика Калмыкия',
		9 => 'Карачаево-Черкесская республика',
		10 => 'Республика Карелия',
		11 => 'Республика Коми',
		12 => 'Республика Марий Эл',
		13 => 'Республика Мордовия',
		14 => 'Республика Саха',
		15 => 'Республика Северная Осетия-Алания',
		16 => 'Республика Татарстан',
		17 => 'Республика Тыва',
		18 => 'Удмуртская республика',
		19 => 'Республика Хакасия',
		20 => 'Чеченская республика',
		21 => 'Чувашская республика',
		22 => 'Алтайский край',
		23 => 'Забайкальский край',
		24 => 'Камчатский край',
		25 => 'Краснодарский край',
		26 => 'Красноярский край',
		27 => 'Пермский край',
		28 => 'Приморский край',
		29 => 'Ставропольский край',
		30 => 'Хабаровский край',
		31 => 'Амурская область',
		32 => 'Архангельская область',
		33 => 'Астраханская область',
		34 => 'Белгородская область',
		35 => 'Брянская область',
		36 => 'Владимирская область',
		37 => 'Волгоградская область',
		38 => 'Вологодская область',
		39 => 'Воронежская область',
		40 => 'Ивановская область',
		41 => 'Иркутская область',
		42 => 'Калининградская область',
		43 => 'Калужская область',
		44 => 'Кемеровская область',
		45 => 'Кировская область',
		46 => 'Костромская область',
		47 => 'Курганская область',
		48 => 'Курская область',
		49 => 'Ленинградская область',
		50 => 'Липецкая область',
		51 => 'Магаданская область',
		52 => 'Московская область',
		53 => 'Мурманская область',
		54 => 'Нижегородская область',
		55 => 'Новгородская область',
		56 => 'Новосибирская область',
		57 => 'Омская область',
		58 => 'Оренбургская область',
		59 => 'Орловская область',
		60 => 'Пензенская область',
		61 => 'Псковская область',
		62 => 'Ростовская область',
		63 => 'Рязанская область',
		64 => 'Самарская область',
		65 => 'Саратовская область',
		66 => 'Сахалинская область',
		67 => 'Свердловская область',
		68 => 'Смоленская область',
		69 => 'Тамбовская область',
		70 => 'Тверская область',
		71 => 'Томская область',
		72 => 'Тульская область',
		73 => 'Тюменская область',
		74 => 'Ульяновская область',
		75 => 'Челябинская область',
		76 => 'Ярославская область',
		77 => 'Город Москва',
		78 => 'Город Санкт-Петербург',
		79 => 'Еврейская автономная область',
		80 => 'Ненецкий автономный округ',
		81 => 'Ханты-Мансийский автономный округ',
		82 => 'Чукотский автономный округ',
		83 => 'Ямало-Ненецкий автономный округ'
	);
	
	// полные наименования в родительном падеже
	public static $_RF_SUBJECTS_GENITIVE = array
	(
		1 => 'республики Адыгеи',
		2 => 'республики Алтай',
		3 => 'республики Башкортостан',
		4 => 'республики Бурятии',
		5 => 'республики Дагестан',
		6 => 'республики Ингушетии',
		7 => 'Кабардино-Балкарской республики',
		8 => 'республики Калмыкии',
		9 => 'Карачаево-Черкесской республики',
		10 => 'республики Карелии',
		11 => 'республики Коми',
		12 => 'республики Марий Эл',
		13 => 'республики Мордовии',
		14 => 'республики Саха',
		15 => 'республики Северной Осетии',
		16 => 'республики Татарстан',
		17 => 'республики Тыва',
		18 => 'Удмуртской республики',
		19 => 'республики Хакасии',
		20 => 'Чеченской республики',
		21 => 'Чувашской республики',
		22 => 'Алтайского края',
		23 => 'Забайкальского края',
		24 => 'Камчатского края',
		25 => 'Краснодарского края',
		26 => 'Красноярского края',
		27 => 'Пермского края',
		28 => 'Приморского края',
		29 => 'Ставропольского края',
		30 => 'Хабаровского края',
		31 => 'Амурской области',
		32 => 'Архангельской области',
		33 => 'Астраханской области',
		34 => 'Белгородской области',
		35 => 'Брянской области',
		36 => 'Владимирской области',
		37 => 'Волгоградской области',
		38 => 'Вологодской области',
		39 => 'Воронежской области',
		40 => 'Ивановской области',
		41 => 'Иркутской области',
		42 => 'Калининградской области',
		43 => 'Калужской области',
		44 => 'Кемеровской области',
		45 => 'Кировской области',
		46 => 'Костромской области',
		47 => 'Курганской области',
		48 => 'Курской области',
		49 => 'Ленинградской области',
		50 => 'Липецкой области',
		51 => 'Магаданской области',
		52 => 'Московской области',
		53 => 'Мурманской области',
		54 => 'Нижегородской области',
		55 => 'Новгородской области',
		56 => 'Новосибирской области',
		57 => 'Омской области',
		58 => 'Оренбургской области',
		59 => 'Орловской области',
		60 => 'Пензенской области',
		61 => 'Псковской области',
		62 => 'Ростовской области',
		63 => 'Рязанской области',
		64 => 'Самарской области',
		65 => 'Саратовской области',
		66 => 'Сахалинской области',
		67 => 'Свердловской области',
		68 => 'Смоленской области',
		69 => 'Тамбовской области',
		70 => 'Тверской области',
		71 => 'Томской области',
		72 => 'Тульской области',
		73 => 'Тюменской области',
		74 => 'Ульяновской области',
		75 => 'Челябинской области',
		76 => 'Ярославской области',
		77 => 'города Москвы',
		78 => 'города Санкт-Петербурга',
		79 => 'Еврейской автономной области',
		80 => 'Ненецкого автономного округа',
		81 => 'Ханты-Мансийского автономного округа',
		82 => 'Чукотского автономного округа',
		83 => 'Ямало-Ненецкого автономного округа'
	);
	
	// найти id региона по названию
	public static function GetID($subject_name)
	{
		$subject_name = trim($subject_name, " \n\t");
		
		$result = CGreensightRFSubject::gs_array_search($subject_name, CGreensightRFSubject::$_RF_SUBJECTS);
		if(!$result)
		{
			$subject_name = explode(' ', $subject_name);
			foreach($subject_name as $s)
			{
				$ls = ToLower($s);
				if
				(
					$ls == 'республика'
					|| $ls == 'край'
					|| $ls == 'область'
					|| $ls == 'округ'
				)
				{
					continue;
				}
				$result = CGreensightRFSubject::gs_array_search($s, CGreensightRFSubject::$_RF_SUBJECTS);
				if($result)
				{
					break;
				}
			}
		}
		return $result;
	}
	
	// нечувствительный к регистру поиск по массиву
	protected function gs_array_search($needle, $haystack)
	{
		foreach($haystack as $k => $v)
		{
			if(ToUpper($v) == ToUpper($needle))
			{
				return $k;
			}
		}
		return false;
	}
	
	//Проверка - есть ли регион по ID
	public function isID($id)
	{
		$ret=false;
		foreach(CGreensightRFSubject::$_RF_SUBJECTS as $k => $v)
		{			
			if ($k==$id) $ret=true;
		}
		return $ret;
	}
}

?>